Documents/ПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПеремещениеТоваров</Name>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.КГМ_Прослеживаемость</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>алкСуммаАкцизаНачисленного</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/КГМ_Прослеживаемость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КГМ_Прослеживаемость</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Акциз</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КорНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КорПартия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КорСклад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КорПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтоимостьОплачено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоДоп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТехнологическаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КГМ_ТехнологическиеОперацииВиноделия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперацииДляПрослеживаемости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийДляПрослеживаемости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГУИДЗаписи</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПеремещениеТоваров/Ext/ObjectModule.bsl
&После("ОбработкаПроведения")
Процедура КГМ_ОбработкаПроведения(Отказ, РежимПроведения)
	// регистр КГМ_Прослеживаемость
	Движения.КГМ_Прослеживаемость.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		// Расход ====================================================================================================================
		Движение = Движения.КГМ_Прослеживаемость.Добавить();
		
		Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;
		Движение.Период			= Дата;
		
		// Измерения 
		Движение.Номенклатура	= ТекСтрокаТовары.Номенклатура;
		Движение.Партия			= ТекСтрокаТовары.Серия;
		Движение.Склад			= СкладОтправитель;
		Движение.Подразделение	= Подразделение;
		
		// Ресурсы
		Движение.Количество		= ТекСтрокаТовары.Количество;
		Движение.Стоимость		= 0;
		Движение.Акциз			= 0;
		
		// Реквизиты
		Движение.КорНоменклатура	= ТекСтрокаТовары.Номенклатура;
		Движение.КорПартия			= ТекСтрокаТовары.Серия;
		Движение.КорСклад			= СкладПолучатель;
		Движение.КорПодразделение	= Подразделение;
		//Движение.Контрагент			= Контрагент;
		Движение.СтоимостьОплачено	= 0;
		Движение.КоличествоДоп		= ТекСтрокаТовары.Количество;
		
		Движение.ТехнологическаяОперация		= Справочники.КГМ_ТехнологическиеОперацииВиноделия.ПеремещениеВРозницу;
		Движение.ВидОперацииДляПрослеживаемости	= Перечисления.ВидыОперацийДляПрослеживаемости.ПоставкаАПРознице;  
		Движение.ГУИДЗаписи = Новый УникальныйИдентификатор();
		
		
		// Приход ==========================================================================================================================
		Движение = Движения.КГМ_Прослеживаемость.Добавить();
		
		Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;
		Движение.Период			= Дата;
		
		// Измерения 
		Движение.Номенклатура	= ТекСтрокаТовары.Номенклатура;
		Движение.Партия			= ТекСтрокаТовары.Серия;
		Движение.Склад			= СкладПолучатель;
		Движение.Подразделение	= Подразделение;
		
		// Ресурсы
		Движение.Количество		= ТекСтрокаТовары.Количество;
		Движение.Стоимость		= 0;
		Движение.Акциз			= ТекСтрокаТовары.алкСуммаАкцизаНачисленного;
//	#Кондрат 30.09.2021 [>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
		Движение.КоличествоРеализации = ТекСтрокаТовары.Количество*ТекСтрокаТовары.Номенклатура.ОбъемДал*10; // в литрах!
//	#Кондрат 30.09.2021 ]<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
		
		
		// Реквизиты
		Движение.КорНоменклатура	= ТекСтрокаТовары.Номенклатура;
		Движение.КорПартия			= ТекСтрокаТовары.Серия;
		Движение.КорСклад			= СкладОтправитель;
		Движение.КорПодразделение	= Подразделение;
		//Движение.Контрагент			= Контрагент;
		Движение.СтоимостьОплачено	= 0;
		Движение.КоличествоДоп		= ТекСтрокаТовары.Количество;
		
		Движение.ТехнологическаяОперация		= Справочники.КГМ_ТехнологическиеОперацииВиноделия.ПеремещениеВРозницу;		
		Движение.ВидОперацииДляПрослеживаемости	= Перечисления.ВидыОперацийДляПрослеживаемости.ПоставкаАПРознице;
		Движение.ГУИДЗаписи = Новый УникальныйИдентификатор();
	КонецЦикла;
	
	
КонецПроцедуры
